Revit 2026 API

# SpatialElementBoundarySubface Class

---

SpatialElementBoundarySubface represents the geometry boundary information of spatial element.

SystemObject Autodesk.Revit.DBSpatialElementBoundarySubface

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpatialElementBoundarySubface : IDisposable
```
```vb
Public Class SpatialElementBoundarySubface
	Implements IDisposable
```
```cpp
public ref class SpatialElementBoundarySubface : IDisposable
```
```fsharp
type SpatialElementBoundarySubface =
    class
        interface IDisposable
    end
```

The SpatialElementBoundarySubface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SpatialBoundaryElement | Element that gave rise to this room face. |
|  | SubfaceArisesFromElementFace | Indicates if the subface is coincident with a portion of a (possibly offset) face of the element. |
|  | SubfaceType | Type of the subface. |
|  | Valid | Indicates if the subface instance is valid and can be used. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SpatialElementBoundarySubface |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundingElementFace | Returns the face of the bounding element. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSpatialElementFace | Returns the face of the spatial element's 3D geometry. |
|  | GetSubface | Returns a face that represents the portion of the room face bounded by the boundary element. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace